---
type: PointCloudType
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# PointCloudType

`Autodesk.Revit.DB.PointCloudType` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2012 | `public static PointCloudType Create ( Document document , string engineIdentifier , string typeIdentifier )` |
| Method | GetPath | 2016 | `public ModelPath GetPath ()` |
| Method | GetReCapProject | 2022 | `public RCProject GetReCapProject ()` |
| Property | ColorEncoding | 2012 | `public PointCloudColorEncoding ColorEncoding { get ; }` |
| Property | EngineIdentifier | 2012 | `public string EngineIdentifier { get ; }` |
| Property | FoundStatus | 2012 | `public PointCloudFoundStatus FoundStatus { get ; }` |
| Property | Offset | 2012 | `public XYZ Offset { get ; }` |
| Property | Parameter | — | `` |
| Property | Scale | 2012 | `public double Scale { get ; set ; }` |